Rahix/avr-device/vendor/atmega1284p.atdf
        <register caption="Timer/Counter3 Output Compare Register B Bytes" name="OCR3B" offset="0x9A" size="2" mask="0xFFFF">
          <bitfield caption="Timer/Counter3 Output Compare B bits" mask="0xFFFF" name="OCR3B"/>
        </register>
        <register caption="Timer/Counter3 Input Capture Register Bytes" name="ICR3" offset="0x96" size="2" mask="0xFFFF">
          <bitfield caption="Timer/Counter3 Input Capture bits" mask="0xFFFF" name="ICR3"/>
        </register>
      </register-group>
      <value-group caption="" name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
        <value caption="Running, ExtClk Tx Falling Edge" name="VAL_0x06" value="0x06"/>
        <value caption="Running, ExtClk Tx Rising Edge" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 8-bit Async" name="TC8_ASYNC">
      <register-group caption="Timer/Counter, 8-bit Async" name="TC2">
        <register caption="Timer/Counter Interrupt Mask register" name="TIMSK2" offset="0x70" size="1">
          <bitfield caption="Timer/Counter2 Output Compare Match B Interrupt Enable" mask="0x04" name="OCIE2B"/>
          <bitfield caption="Timer/Counter2 Output Compare Match A Interrupt Enable" mask="0x02" name="OCIE2A"/>
          <bitfield caption="Timer/Counter2 Overflow Interrupt Enable" mask="0x01" name="TOIE2"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag Register" name="TIFR2" offset="0x37" size="1" ocd-rw="R">
          <bitfield caption="Output Compare Flag 2B" mask="0x04" name="OCF2B"/>
          <bitfield caption="Output Compare Flag 2A" mask="0x02" name="OCF2A"/>
          <bitfield caption="Timer/Counter2 Overflow Flag" mask="0x01" name="TOV2"/>
        </register>
        <register caption="Timer/Counter2 Control Register A" name="TCCR2A" offset="0xB0" size="1">
          <bitfield caption="Compare Output Mode bits" mask="0xC0" name="COM2A"/>
          <bitfield caption="Compare Output Mode bits" mask="0x30" name="COM2B"/>
          <bitfield caption="Waveform Genration Mode" mask="0x03" name="WGM2"/>
        </register>
        <register caption="Timer/Counter2 Control Register B" name="TCCR2B" offset="0xB1" size="1">
          <bitfield caption="Force Output Compare A" mask="0x80" name="FOC2A"/>
          <bitfield caption="Force Output Compare B" mask="0x40" name="FOC2B"/>
          <bitfield caption="Waveform Generation Mode" mask="0x08" name="WGM22"/>
          <bitfield caption="Clock Select bits" mask="0x07" name="CS2" values="CLK_SEL_3BIT"/>
        </register>
        <register caption="Timer/Counter2" name="TCNT2" offset="0xB2" size="1" mask="0xFF">
          <bitfield caption="Timer/Counter2 bits" mask="0xFF" name="TCNT2"/>
        </register>
        <register caption="Timer/Counter2 Output Compare Register B" name="OCR2B" offset="0xB4" size="1" mask="0xFF">
          <bitfield caption="Timer/Counter2 Output Compare B bits" mask="0xFF" name="OCR2B"/>
        </register>
        <register caption="Timer/Counter2 Output Compare Register A" name="OCR2A" offset="0xB3" size="1" mask="0xFF">
          <bitfield caption="Timer/Counter2 Output Compare A bits" mask="0xFF" name="OCR2A"/>
        </register>
        <register caption="Asynchronous Status Register" name="ASSR" offset="0xB6" size="1">
          <bitfield caption="Enable External Clock Input" mask="0x40" name="EXCLK"/>
          <bitfield caption="Asynchronous Timer/Counter2" mask="0x20" name="AS2"/>
          <bitfield caption="Timer/Counter2 Update Busy" mask="0x10" name="TCN2UB"/>
          <bitfield caption="Output Compare Register2 Update Busy" mask="0x08" name="OCR2AUB"/>
          <bitfield caption="Output Compare Register 2 Update Busy" mask="0x04" name="OCR2BUB"/>
          <bitfield caption="Timer/Counter Control Register2 Update Busy" mask="0x02" name="TCR2AUB"/>
          <bitfield caption="Timer/Counter Control Register2 Update Busy" mask="0x01" name="TCR2BUB"/>
        </register>
        <register caption="General Timer Counter Control register" name="GTCCR" offset="0x43" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Prescaler Reset Timer/Counter2" mask="0x02" name="PSRASY"/>
        </register>
      </register-group>
      <value-group caption="" name="CLK_SEL_3BIT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/32" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/64" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/128" name="VAL_0x05" value="0x05"/>
        <value caption="Running, CLK/256" name="VAL_0x06" value="0x06"/>
        <value caption="Running, CLK/1024" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Bootloader" name="BOOT_LOAD">
      <register-group caption="Bootloader" name="BOOT_LOAD">
        <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Signature Row Read" mask="0x20" name="SIGRD"/>
          <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
        <register caption="External Interrupt Control Register A" name="EICRA" offset="0x69" size="1">
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x30" name="ISC2" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x0C" name="ISC1" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL"/>
        </register>
        <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
          <bitfield caption="External Interrupt Request 2 Enable" mask="0x07" name="INT"/>
        </register>
        <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
          <bitfield caption="External Interrupt Flags" mask="0x07" name="INTF"/>
        </register>
        <register caption="Pin Change Mask Register 3" name="PCMSK3" offset="0x73" size="1">
          <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT" lsb="24"/>
        </register>
        <register caption="Pin Change Mask Register 2" name="PCMSK2" offset="0x6D" size="1">
          <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT" lsb="16"/>
        </register>
